---
title: SpaceSet
classe: Autodesk.Revit.DB.Mechanical.SpaceSet
namespace: Autodesk.Revit.DB.Mechanical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# SpaceSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `spaceSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `spaceSet.Size` | Int32 |
| `Void Clear()` | `spaceSet.Clear()` | Void |
| `Boolean Contains(Space)` | `spaceSet.Contains(item)` | Boolean |
| `Int32 Erase(Space)` | `spaceSet.Erase(item)` | Int32 |
| `SpaceSetIterator ForwardIterator()` | `spaceSet.ForwardIterator()` | SpaceSetIterator |
| `IEnumerator GetEnumerator()` | `spaceSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(Space)` | `spaceSet.Insert(item)` | Boolean |
| `SpaceSetIterator ReverseIterator()` | `spaceSet.ReverseIterator()` | SpaceSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```